In [1]:
#data aggregation
import numpy as np, pandas as pd

In [2]:
df=pd.DataFrame({
    'key1':['a','a','b','b','a'],
    'key2':['one','two','one','two','one'],
    'data1':np.random.randn(5),
    'data2':np.random.randn(5)
})

In [3]:
df

  key1 key2     data1     data2
0    a  one  0.205541 -1.696962
1    a  two  0.180560  0.161970
2    b  one  0.803916  1.619730
3    b  two -1.272091  0.107403
4    a  one  1.315067  0.429586

In [4]:
grouped = df.groupby('key1')

How to Find Quantiles?

Sample question: Find the number in the following set of data where 20 percent of values fall below it, and 80 percent fall above:
1 3 5 6 9 11 12 13 19 21 22 32 35 36 45 44 55 68 79 80 81 88 90 91 92 100 112 113 114 120 121 132 145 146 149 150 155 180 189 190

Step 1: Order the data from smallest to largest. The data in the question is already in ascending order.
Step 2: Count how many observations you have in your data set. this particular data set has 40 items.
Step 3: Convert any percentage to a decimal for “q”. We are looking for the number where 20 percent of the values fall below it, so convert that to .2.
Step 4: Insert your values into the formula:
ith observation = q (n + 1)
ith observation = .2 (40 + 1) = 8.2
Answer: The ith observation is at 8.2, so we round down to 8 (remembering that this formula is an estimate). The 8th number in the set is 13, which is the number where 20 percent of the values fall below it.

In [5]:
grouped['data1'].quantile(0.9)

key1
a    1.093162
b    0.596315
Name: data1, dtype: float64

In [6]:
grouped

In [7]:
def peak_to_peak(arr):
    return arr.max() - arr.min()

In [8]:
grouped.agg(peak_to_peak)

         data1     data2
key1
a     1.134508  2.126549
b     2.076007  1.512327

In [9]:
grouped.describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0  0.567056  0.647917  0.180560  0.193050  0.205541  0.760304
b      2.0 -0.234088  1.467959 -1.272091 -0.753089 -0.234088  0.284914

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a     1.315067   3.0 -0.368469  1.158264 -1.696962 -0.767496  0.161970
b     0.803916   2.0  0.863567  1.069377  0.107403  0.485485  0.863567


           75%       max
key1
a     0.295778  0.429586
b     1.241648  1.619730

In [10]:
#Column-Wise and Multiple Function Application

In [11]:
tips = pd.read_csv('examples/tips.csv')

In [14]:
tips

     total_bill   tip smoker   day    time  size
0         16.99  1.01     No   Sun  Dinner     2
1         10.34  1.66     No   Sun  Dinner     3
2         21.01  3.50     No   Sun  Dinner     3
3         23.68  3.31     No   Sun  Dinner     2
4         24.59  3.61     No   Sun  Dinner     4
..          ...   ...    ...   ...     ...   ...
239       29.03  5.92     No   Sat  Dinner     3
240       27.18  2.00    Yes   Sat  Dinner     2
241       22.67  2.00    Yes   Sat  Dinner     2
242       17.82  1.75     No   Sat  Dinner     2
243       18.78  3.00     No  Thur  Dinner     2

[244 rows x 6 columns]